bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/atdf/ATSAMC21N18A.atdf
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x42004000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PB12"/>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="0" function="E" pad="PB08"/>
              <signal group="WO" index="1" function="E" pad="PB09"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
              <signal group="WO" index="1" function="E" pad="PB13"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="39" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="40" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="41" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="32" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="80"/>
            </parameters>
          </instance>
          <instance name="TC5">
            <register-group name="TC5" name-in-module="TC" address-space="base" offset="0x43000800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PB14"/>
              <signal group="WO" index="0" function="E" pad="PA24"/>
              <signal group="WO" index="0" function="E" pad="PB10"/>
              <signal group="WO" index="1" function="E" pad="PA25"/>
              <signal group="WO" index="1" function="E" pad="PB11"/>
              <signal group="WO" index="1" function="E" pad="PB15"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="53" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="54" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="55" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="43" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="98"/>
            </parameters>
          </instance>
          <instance name="TC6">
            <register-group name="TC6" name-in-module="TC" address-space="base" offset="0x43000C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PB16"/>
              <signal group="WO" index="0" function="E" pad="PB02"/>
              <signal group="WO" index="1" function="E" pad="PB17"/>
              <signal group="WO" index="1" function="E" pad="PB03"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="56" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="57" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="58" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="44" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="99"/>
            </parameters>
          </instance>
          <instance name="TC7">
            <register-group name="TC7" name-in-module="TC" address-space="base" offset="0x43001000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PB22"/>
              <signal group="WO" index="0" function="E" pad="PA20"/>
              <signal group="WO" index="0" function="E" pad="PB00"/>
              <signal group="WO" index="1" function="E" pad="PB01"/>
              <signal group="WO" index="1" function="E" pad="PA21"/>
              <signal group="WO" index="1" function="E" pad="PB23"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="59" caption="Indexes of DMA Overflow trigger"/>
              <param name="DMAC_ID_MC0" value="60" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="61" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="EXT" value="0" caption="Coding of implemented extended features (keep 0 value)"/>
              <param name="GCLK_ID" value="45" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="0" caption="TC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OW_NUM" value="2" caption="Number of Output Waveforms"/>
              <param name="INSTANCE_ID" value="100"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="3.1.0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x42002400"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA08"/>
              <signal group="WO" index="1" function="F" pad="PA09"/>
              <signal group="WO" index="2" function="F" pad="PA10"/>
              <signal group="WO" index="3" function="F" pad="PA11"/>
              <signal group="WO" index="4" function="F" pad="PB10"/>
              <signal group="WO" index="5" function="F" pad="PB11"/>
              <signal group="WO" index="6" function="F" pad="PA12"/>
              <signal group="WO" index="6" function="F" pad="PB12"/>
              <signal group="WO" index="7" function="F" pad="PA13"/>
              <signal group="WO" index="7" function="F" pad="PB13"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="16" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="17" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="18" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="DMAC_ID_MC2" value="19" caption="Indexes of DMA Match/Compare 2 trigger"/>
              <param name="DMAC_ID_MC3" value="20" caption="Indexes of DMA Match/Compare 3 trigger"/>
              <param name="DTI" value="1" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="31" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="28" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="1" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="1" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="8" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="73"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x42002800"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA16"/>
              <signal group="WO" index="0" function="F" pad="PA22"/>
              <signal group="WO" index="1" function="F" pad="PA17"/>
              <signal group="WO" index="1" function="F" pad="PA23"/>
              <signal group="WO" index="2" function="F" pad="PA18"/>
              <signal group="WO" index="2" function="F" pad="PB22"/>
              <signal group="WO" index="3" function="F" pad="PA19"/>
              <signal group="WO" index="3" function="F" pad="PB23"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare/Capture units"/>
              <param name="DITHERING" value="1" caption="Dithering feature implemented"/>
              <param name="DMAC_ID_OVF" value="21" caption="DMA overflow/underflow/retrigger trigger"/>
              <param name="DMAC_ID_MC0" value="22" caption="Indexes of DMA Match/Compare 0 trigger"/>
              <param name="DMAC_ID_MC1" value="23" caption="Indexes of DMA Match/Compare 1 trigger"/>
              <param name="DTI" value="0" caption="Dead-Time-Insertion feature implemented"/>
              <param name="EXT" value="24" caption="Coding of implemented extended features"/>
              <param name="GCLK_ID" value="28" caption="Index of Generic Clock"/>
              <param name="MASTER_SLAVE_MODE" value="2" caption="TCC type 0 : NA, 1 : Master, 2 : Slave"/>
              <param name="OTMX" value="0" caption="Output Matrix feature implemented"/>
              <param name="OW_NUM" value="4" caption="Number of Output Waveforms"/>
              <param name="PG" value="1" caption="Pattern Generation feature implemented"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="0" caption="DTI outputs swap feature implemented"/>
              <param name="INSTANCE_ID" value="74"/>
            </parameters>
          </instance>
