bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/atdf/ATSAMC21N18A.atdf
    <module name="HMATRIXB" id="I7638" version="2.1.4" caption="HSB Matrix">
      <register-group name="PRS" size="0x8">
        <register name="PRAS" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority A for Slave">
          <bitfield name="M0PR" caption="Master 0 Priority" mask="0xF"/>
          <bitfield name="M1PR" caption="Master 1 Priority" mask="0xF0"/>
          <bitfield name="M2PR" caption="Master 2 Priority" mask="0xF00"/>
          <bitfield name="M3PR" caption="Master 3 Priority" mask="0xF000"/>
          <bitfield name="M4PR" caption="Master 4 Priority" mask="0xF0000"/>
          <bitfield name="M5PR" caption="Master 5 Priority" mask="0xF00000"/>
          <bitfield name="M6PR" caption="Master 6 Priority" mask="0xF000000"/>
          <bitfield name="M7PR" caption="Master 7 Priority" mask="0xF0000000"/>
        </register>
        <register name="PRBS" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Priority B for Slave">
          <bitfield name="M8PR" caption="Master 8 Priority" mask="0xF"/>
          <bitfield name="M9PR" caption="Master 9 Priority" mask="0xF0"/>
          <bitfield name="M10PR" caption="Master 10 Priority" mask="0xF00"/>
          <bitfield name="M11PR" caption="Master 11 Priority" mask="0xF000"/>
          <bitfield name="M12PR" caption="Master 12 Priority" mask="0xF0000"/>
          <bitfield name="M13PR" caption="Master 13 Priority" mask="0xF00000"/>
          <bitfield name="M14PR" caption="Master 14 Priority" mask="0xF000000"/>
          <bitfield name="M15PR" caption="Master 15 Priority" mask="0xF0000000"/>
        </register>
      </register-group>
      <register-group name="HMATRIXB" caption="HSB Matrix">
        <register name="MCFG" offset="0x0" rw="RW" size="4" access-size="4" count="16" initval="0x00000002" caption="Master Configuration">
          <bitfield name="ULBT" caption="Undefined Length Burst Type" mask="0x7" values="HMATRIXB_MCFG__ULBT"/>
        </register>
        <register name="SCFG" offset="0x40" rw="RW" size="4" access-size="4" count="16" initval="0x00000010" caption="Slave Configuration">
          <bitfield name="SLOT_CYCLE" caption="Maximum Number of Allowed Cycles for a Burst" mask="0xFF"/>
          <bitfield name="DEFMSTR_TYPE" caption="Default Master Type" mask="0x30000" values="HMATRIXB_SCFG__DEFMSTR_TYPE"/>
          <bitfield name="FIXED_DEFMSTR" caption="Fixed Index of Default Master" mask="0x3C0000"/>
          <bitfield name="ARBT" caption="Arbitration Type" mask="0x1000000" values="HMATRIXB_SCFG__ARBT"/>
        </register>
        <register-group name="PRS" name-in-module="PRS" offset="0x080" size="0x8" count="4"/>
        <register name="MRCR" offset="0x100" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Master Remap Control">
          <bitfield name="RCB0" caption="Remap Command Bit for Master 0" mask="0x1" values="HMATRIXB_MRCR__RCB0"/>
          <bitfield name="RCB1" caption="Remap Command Bit for Master 1" mask="0x2" values="HMATRIXB_MRCR__RCB1"/>
          <bitfield name="RCB2" caption="Remap Command Bit for Master 2" mask="0x4" values="HMATRIXB_MRCR__RCB2"/>
          <bitfield name="RCB3" caption="Remap Command Bit for Master 3" mask="0x8" values="HMATRIXB_MRCR__RCB3"/>
          <bitfield name="RCB4" caption="Remap Command Bit for Master 4" mask="0x10" values="HMATRIXB_MRCR__RCB4"/>
          <bitfield name="RCB5" caption="Remap Command Bit for Master 5" mask="0x20" values="HMATRIXB_MRCR__RCB5"/>
          <bitfield name="RCB6" caption="Remap Command Bit for Master 6" mask="0x40" values="HMATRIXB_MRCR__RCB6"/>
          <bitfield name="RCB7" caption="Remap Command Bit for Master 7" mask="0x80" values="HMATRIXB_MRCR__RCB7"/>
          <bitfield name="RCB8" caption="Remap Command Bit for Master 8" mask="0x100" values="HMATRIXB_MRCR__RCB8"/>
          <bitfield name="RCB9" caption="Remap Command Bit for Master 9" mask="0x200" values="HMATRIXB_MRCR__RCB9"/>
          <bitfield name="RCB10" caption="Remap Command Bit for Master 10" mask="0x400" values="HMATRIXB_MRCR__RCB10"/>
          <bitfield name="RCB11" caption="Remap Command Bit for Master 11" mask="0x800" values="HMATRIXB_MRCR__RCB11"/>
          <bitfield name="RCB12" caption="Remap Command Bit for Master 12" mask="0x1000" values="HMATRIXB_MRCR__RCB12"/>
          <bitfield name="RCB13" caption="Remap Command Bit for Master 13" mask="0x2000" values="HMATRIXB_MRCR__RCB13"/>
          <bitfield name="RCB14" caption="Remap Command Bit for Master 14" mask="0x4000" values="HMATRIXB_MRCR__RCB14"/>
          <bitfield name="RCB15" caption="Remap Command Bit for Master 15" mask="0x8000" values="HMATRIXB_MRCR__RCB15"/>
        </register>
        <register name="SFR" offset="0x110" rw="RW" size="4" access-size="4" count="16" initval="0x00000000" caption="Special Function">
          <bitfield name="SFR" caption="Special Function Register" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="HMATRIXB_MCFG__ULBT">
        <value name="INFINITE" caption="Infinite Length" value="0"/>
        <value name="SINGLE" caption="Single Access" value="1"/>
        <value name="FOUR_BEAT" caption="Four Beat Burst" value="2"/>
        <value name="EIGHT_BEAT" caption="Eight Beat Burst" value="3"/>
        <value name="SIXTEEN_BEAT" caption="Sixteen Beat Burst" value="4"/>
      </value-group>
      <value-group name="HMATRIXB_SCFG__ARBT">
        <value name="ROUND_ROBIN" caption="Round-Robin Arbitration" value="0"/>
        <value name="FIXED_PRIORITY" caption="Fixed Priority Arbitration" value="1"/>
      </value-group>
      <value-group name="HMATRIXB_SCFG__DEFMSTR_TYPE">
        <value name="NO_DEFAULT" caption="No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst." value="0"/>
        <value name="LAST_DEFAULT" caption="Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave." value="1"/>
        <value name="FIXED_DEFAULT" caption="Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave." value="2"/>
      </value-group>
