bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/atdf/ATSAMC21N18A.atdf
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000002" caption="Peripheral write protection status - Bridge B">
          <bitfield name="PORT_" caption="PORT APB Protect Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Protect Enable" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC APB Protect Enable" mask="0x8"/>
          <bitfield name="MTB_" caption="MTB APB Protect Enable" mask="0x10"/>
          <bitfield name="HMATRIXHS_" caption="HMATRIXHS APB Protect Enable" mask="0x20"/>
        </register>
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x02000000" caption="Peripheral write protection status - Bridge C">
          <bitfield name="EVSYS_" caption="EVSYS APB Protect Enable" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Protect Enable" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Protect Enable" mask="0x4"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Protect Enable" mask="0x8"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Protect Enable" mask="0x10"/>
          <bitfield name="SERCOM4_" caption="SERCOM4 APB Protect Enable" mask="0x20"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 APB Protect Enable" mask="0x40"/>
          <bitfield name="CAN0_" caption="CAN0 APB Protect Enable" mask="0x80"/>
          <bitfield name="CAN1_" caption="CAN1 APB Protect Enable" mask="0x100"/>
          <bitfield name="TCC0_" caption="TCC0 APB Protect Enable" mask="0x200"/>
          <bitfield name="TCC1_" caption="TCC1 APB Protect Enable" mask="0x400"/>
          <bitfield name="TCC2_" caption="TCC2 APB Protect Enable" mask="0x800"/>
          <bitfield name="TC0_" caption="TC0 APB Protect Enable" mask="0x1000"/>
          <bitfield name="TC1_" caption="TC1 APB Protect Enable" mask="0x2000"/>
          <bitfield name="TC2_" caption="TC2 APB Protect Enable" mask="0x4000"/>
          <bitfield name="TC3_" caption="TC3 APB Protect Enable" mask="0x8000"/>
          <bitfield name="TC4_" caption="TC4 APB Protect Enable" mask="0x10000"/>
          <bitfield name="ADC0_" caption="ADC0 APB Protect Enable" mask="0x20000"/>
          <bitfield name="ADC1_" caption="ADC1 APB Protect Enable" mask="0x40000"/>
          <bitfield name="SDADC_" caption="SDADC APB Protect Enable" mask="0x80000"/>
          <bitfield name="AC_" caption="AC APB Protect Enable" mask="0x100000"/>
          <bitfield name="DAC_" caption="DAC APB Protect Enable" mask="0x200000"/>
          <bitfield name="PTC_" caption="PTC APB Protect Enable" mask="0x400000"/>
          <bitfield name="CCL_" caption="CCL APB Protect Enable" mask="0x800000"/>
        </register>
        <register name="STATUSD" offset="0x40" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge D">
          <bitfield name="SERCOM6_" caption="SERCOM6 APB Protect Enable" mask="0x1"/>
          <bitfield name="SERCOM7_" caption="SERCOM7 APB Protect Enable" mask="0x2"/>
          <bitfield name="TC5_" caption="TC5 APB Protect Enable" mask="0x4"/>
          <bitfield name="TC6_" caption="TC6 APB Protect Enable" mask="0x8"/>
          <bitfield name="TC7_" caption="TC7 APB Protect Enable" mask="0x10"/>
        </register>
      </register-group>
      <value-group name="PAC_WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="SETLCK" caption="Set and lock protection" value="3"/>
      </value-group>
    </module>
    <module name="PM" id="U2240" version="2.1.1" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="SLEEPCFG" offset="0x1" rw="RW" size="1" initval="0x00" caption="Sleep Configuration">
          <bitfield name="SLEEPMODE" caption="Sleep Mode" mask="0x7" values="PM_SLEEPCFG__SLEEPMODE"/>
        </register>
        <register name="STDBYCFG" offset="0x8" rw="RW" size="2" initval="0x0400" caption="Standby Configuration">
          <bitfield name="VREGSMOD" caption="Voltage Regulator Standby mode" mask="0xC0" values="PM_STDBYCFG__VREGSMOD"/>
          <bitfield name="BBIASHS" caption="Back Bias for HMCRAMCHS" mask="0xC00"/>
        </register>
      </register-group>
      <value-group name="PM_SLEEPCFG__SLEEPMODE">
        <value name="IDLE0" caption="CPU clock is OFF" value="0"/>
        <value name="IDLE1" caption="AHB clock is OFF" value="1"/>
        <value name="IDLE2" caption="APB clock are OFF" value="2"/>
        <value name="STANDBY" caption="All Clocks are OFF" value="4"/>
        <value name="BACKUP" caption="Only Backup domain is powered ON" value="5"/>
        <value name="OFF" caption="All power domains are powered OFF" value="6"/>
      </value-group>
      <value-group name="PM_STDBYCFG__LINKPD">
        <value name="DEFAULT" caption="Power domains are not linked" value="0"/>
        <value name="PD01" caption="PD0 and PD1 power domains are linked" value="1"/>
        <value name="PD12" caption="PD1 and PD2 power domains are linked" value="2"/>
        <value name="PD012" caption="All power domains are linked" value="3"/>
      </value-group>
      <value-group name="PM_STDBYCFG__PDCFG">
        <value name="DEFAULT" caption="All power domains switching is handled by hardware." value="0"/>
        <value name="PD0" caption="PD0 is forced ACTIVE. PD1 and PD2 power domains switching is handled by hardware." value="1"/>
        <value name="PD01" caption="PD0 and PD1 are forced ACTIVE. PD2 power domain switching is handled by hardware." value="2"/>
        <value name="PD012" caption="All power domains are forced ACTIVE." value="3"/>
      </value-group>
      <value-group name="PM_STDBYCFG__VREGSMOD">
        <value name="AUTO" caption="Automatic mode" value="0"/>
        <value name="PERFORMANCE" caption="Performance oriented" value="1"/>
        <value name="LP" caption="Low Power oriented" value="2"/>
      </value-group>
    </module>
    <module name="PORT" id="U2210" version="2.1.1" caption="Port Module">
      <register-group name="GROUP" size="0x80">
        <register name="DIR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Data Direction">
        </register>
        <register name="DIRCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:DIR" initval="0x00000000" caption="Data Direction Clear">
        </register>
        <register name="DIRSET" offset="0x8" rw="RW" size="4" atomic-op="set:DIR" initval="0x00000000" caption="Data Direction Set">
        </register>
        <register name="DIRTGL" offset="0xC" rw="RW" size="4" atomic-op="toggle:DIR" initval="0x00000000" caption="Data Direction Toggle">
        </register>
        <register name="OUT" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Data Output Value">
        </register>
        <register name="OUTCLR" offset="0x14" rw="RW" size="4" atomic-op="clear:OUT" initval="0x00000000" caption="Data Output Value Clear">
        </register>
        <register name="OUTSET" offset="0x18" rw="RW" size="4" atomic-op="set:OUT" initval="0x00000000" caption="Data Output Value Set">
        </register>
        <register name="OUTTGL" offset="0x1C" rw="RW" size="4" atomic-op="toggle:OUT" initval="0x00000000" caption="Data Output Value Toggle">
        </register>
        <register name="IN" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Data Input Value">
        </register>
        <register name="CTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SAMPLING" caption="Input Sampling Mode" mask="0xFFFFFFFF"/>
        </register>
