bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/atdf/ATSAMC21N18A.atdf
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
          <bitfield name="VREG33RDY" caption="VREG33 Ready" mask="0x40"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
          <bitfield name="VREG33RDY" caption="VREG33 Ready" mask="0x40"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
          <bitfield name="VREG33RDY" caption="VREG33 Ready" mask="0x40"/>
        </register>
        <register name="BODVDD" offset="0x10" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="BODVDD Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="HYST" caption="Hysteresis Enable" mask="0x4"/>
          <bitfield name="ACTION" caption="Action when Threshold Crossed" mask="0x18" values="SUPC_BODVDD__ACTION"/>
          <bitfield name="STDBYCFG" caption="Configuration in Standby mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ACTCFG" caption="Configuration in Active mode" mask="0x100"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF000" values="SUPC_BODVDD__PSEL"/>
          <bitfield name="LEVEL" caption="Threshold Level for VDD" mask="0x3F0000"/>
        </register>
        <register name="VREG" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="VREG Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
        </register>
        <register name="VREF" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="VREF Control">
          <bitfield name="TSEN" caption="Temperature Sensor Output Enable" mask="0x2"/>
          <bitfield name="VREFOE" caption="Voltage Reference Output Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="SEL" caption="Voltage Reference Selection" mask="0xF0000" values="SUPC_VREF__SEL"/>
        </register>
        <register name="VREG33" offset="0x20" rw="RW" size="4" initval="0x00000010" caption="VREG33 Control">
          <bitfield name="ENABLE" caption="VREG33 Enable" mask="0x2"/>
          <bitfield name="ENRDY" caption="VREG33 Ready Enable" mask="0x4"/>
          <bitfield name="BYPASS" caption="VREG33 Bypass" mask="0x8"/>
          <bitfield name="ISOEN" caption="Isolation Enable" mask="0x10"/>
        </register>
      </register-group>
      <value-group name="SUPC_BODVDD__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BODVDD generates a reset" value="0x1"/>
        <value name="INT" caption="The BODVDD generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="SUPC_BODVDD__PSEL">
        <value name="DIV2" caption="Divide clock by 2" value="0x0"/>
        <value name="DIV4" caption="Divide clock by 4" value="0x1"/>
        <value name="DIV8" caption="Divide clock by 8" value="0x2"/>
        <value name="DIV16" caption="Divide clock by 16" value="0x3"/>
        <value name="DIV32" caption="Divide clock by 32" value="0x4"/>
        <value name="DIV64" caption="Divide clock by 64" value="0x5"/>
        <value name="DIV128" caption="Divide clock by 128" value="0x6"/>
        <value name="DIV256" caption="Divide clock by 256" value="0x7"/>
        <value name="DIV512" caption="Divide clock by 512" value="0x8"/>
        <value name="DIV1024" caption="Divide clock by 1024" value="0x9"/>
        <value name="DIV2048" caption="Divide clock by 2048" value="0xA"/>
        <value name="DIV4096" caption="Divide clock by 4096" value="0xB"/>
        <value name="DIV8192" caption="Divide clock by 8192" value="0xC"/>
        <value name="DIV16384" caption="Divide clock by 16384" value="0xD"/>
        <value name="DIV32768" caption="Divide clock by 32768" value="0xE"/>
        <value name="DIV65536" caption="Divide clock by 65536" value="0xF"/>
      </value-group>
      <value-group name="SUPC_VREF__SEL">
        <value name="1V024" caption="1.024V voltage reference typical value" value="0x0"/>
        <value name="2V048" caption="2.048V voltage reference typical value" value="0x2"/>
        <value name="4V096" caption="4.096V voltage reference typical value" value="0x3"/>
      </value-group>
    </module>
    <module name="TC" id="U2249" version="3.0.0" caption="Basic Timer Counter">
      <register-group name="TC" caption="Basic Timer Counter">
        <mode name="COUNT8" qualifier="TC.CTRLA.MODE" value="1" caption="8-bit Counter Mode"/>
        <mode name="COUNT16" qualifier="TC.CTRLA.MODE" value="0" caption="16-bit Counter Mode"/>
        <mode name="COUNT32" qualifier="TC.CTRLA.MODE" value="2" caption="32-bit Counter Mode"/>
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Timer Counter Mode" mask="0xC" values="TC_CTRLA__MODE"/>
          <bitfield name="PRESCSYNC" caption="Prescaler and Counter Synchronization" mask="0x30" values="TC_CTRLA__PRESCSYNC"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="Clock On Demand" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0x700" values="TC_CTRLA__PRESCALER"/>
          <bitfield name="ALOCK" caption="Auto Lock" mask="0x800"/>
          <bitfield name="CAPTEN0" caption="Capture Channel 0 Enable" mask="0x10000"/>
          <bitfield name="CAPTEN1" caption="Capture Channel 1 Enable" mask="0x20000"/>
          <bitfield name="COPEN0" caption="Capture On Pin 0 Enable" mask="0x100000"/>
          <bitfield name="COPEN1" caption="Capture On Pin 1 Enable" mask="0x200000"/>
          <bitfield name="CAPTMODE0" caption="Capture Mode Channel 0" mask="0x3000000" values="TC_CTRLA__CAPTMODE0"/>
          <bitfield name="CAPTMODE1" caption="Capture mode Channel 1" mask="0x18000000" values="TC_CTRLA__CAPTMODE1"/>
        </register>
        <register name="CTRLBCLR" offset="0x4" rw="RW" access="RWSYNC" size="1" atomic-op="clear:CTRLBCLR" initval="0x00" caption="Control B Clear">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot on Counter" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="TC_CTRLBCLR__CMD"/>
        </register>
        <register name="CTRLBSET" offset="0x5" rw="RW" access="RWSYNC" size="1" atomic-op="set:CTRLBSET" initval="0x00" caption="Control B Set">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot on Counter" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="TC_CTRLBSET__CMD"/>
        </register>
