bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/atdf/ATSAMC21N18A.atdf
      <value-group name="SystemControl_ICSR__NMIPENDSET">
        <value name="VALUE_0" caption="Write: no effect; read: NMI exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes NMI exception state to pending; read: NMI exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the SysTick exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTSET">
        <value name="VALUE_0" caption="Write: no effect; read: SysTick exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the PendSV exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVSET">
        <value name="VALUE_0" caption="Write: no effect; read: PendSV exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__ENDIANNESS">
        <value name="VALUE_0" caption="Little-endian" value="0"/>
        <value name="VALUE_1" caption="Big-endian" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__SYSRESETREQ">
        <value name="VALUE_0" caption="No system reset request" value="0"/>
        <value name="VALUE_1" caption="Asserts a signal to the outer system that requests a reset" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SEVONPEND">
        <value name="VALUE_0" caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" value="0"/>
        <value name="VALUE_1" caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__STKALIGN">
        <value name="VALUE_0" caption="4-byte aligned" value="0"/>
        <value name="VALUE_1" caption="8-byte aligned" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAMC21N" caption="SAMC21N">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PC00"/>
      <pin position="4" pad="PC01"/>
      <pin position="5" pad="PC02"/>
      <pin position="6" pad="PC03"/>
      <pin position="7" pad="PA02"/>
      <pin position="8" pad="PA03"/>
      <pin position="9" pad="PB04"/>
      <pin position="10" pad="PB05"/>
      <pin position="11" pad="GNDANA"/>
      <pin position="12" pad="VDDANA"/>
      <pin position="13" pad="PB06"/>
      <pin position="14" pad="PB07"/>
      <pin position="15" pad="PB08"/>
      <pin position="16" pad="PB09"/>
      <pin position="17" pad="PA04"/>
      <pin position="18" pad="PA05"/>
      <pin position="19" pad="PA06"/>
      <pin position="20" pad="PA07"/>
      <pin position="21" pad="PC05"/>
      <pin position="22" pad="PC06"/>
      <pin position="23" pad="PC07"/>
      <pin position="24" pad="GNDIO"/>
      <pin position="25" pad="VDDIO"/>
      <pin position="26" pad="PA08"/>
      <pin position="27" pad="PA09"/>
      <pin position="28" pad="PA10"/>
      <pin position="29" pad="PA11"/>
      <pin position="30" pad="PB10"/>
      <pin position="31" pad="PB11"/>
      <pin position="32" pad="PB12"/>
      <pin position="33" pad="PB13"/>
      <pin position="34" pad="PB14"/>
      <pin position="35" pad="PB15"/>
      <pin position="36" pad="VDDIO"/>
      <pin position="37" pad="GNDIO"/>
      <pin position="38" pad="PC08"/>
      <pin position="39" pad="PC09"/>
      <pin position="40" pad="PC10"/>
      <pin position="41" pad="PC11"/>
      <pin position="42" pad="PC12"/>
      <pin position="43" pad="PC13"/>
      <pin position="44" pad="PC14"/>
      <pin position="45" pad="PC15"/>
      <pin position="46" pad="PA12"/>
      <pin position="47" pad="PA13"/>
      <pin position="48" pad="PA14"/>
      <pin position="49" pad="PA15"/>
      <pin position="50" pad="GNDIO"/>
      <pin position="51" pad="VDDIO"/>
      <pin position="52" pad="PA16"/>
      <pin position="53" pad="PA17"/>
      <pin position="54" pad="PA18"/>
      <pin position="55" pad="PA19"/>
      <pin position="56" pad="PC16"/>
      <pin position="57" pad="PC17"/>
      <pin position="58" pad="PC18"/>
      <pin position="59" pad="PC19"/>
      <pin position="60" pad="PC20"/>
      <pin position="61" pad="PC21"/>
      <pin position="62" pad="GNDIO"/>
      <pin position="63" pad="VDDIO"/>
      <pin position="64" pad="PB16"/>
      <pin position="65" pad="PB17"/>
      <pin position="66" pad="PB18"/>
      <pin position="67" pad="PB19"/>
      <pin position="68" pad="PB20"/>
      <pin position="69" pad="PB21"/>
      <pin position="70" pad="PA20"/>
      <pin position="71" pad="PA21"/>
      <pin position="72" pad="PA22"/>
      <pin position="73" pad="PA23"/>
      <pin position="74" pad="PA24"/>
      <pin position="75" pad="PA25"/>
      <pin position="76" pad="GNDIO"/>
      <pin position="77" pad="VDDIO"/>
      <pin position="78" pad="PB22"/>
      <pin position="79" pad="PB23"/>
      <pin position="80" pad="PB24"/>
      <pin position="81" pad="PB25"/>
      <pin position="82" pad="PC24"/>
      <pin position="83" pad="PC25"/>
      <pin position="84" pad="PC26"/>
      <pin position="85" pad="PC27"/>
      <pin position="86" pad="PC28"/>
      <pin position="87" pad="PA27"/>
      <pin position="88" pad="RESET_N"/>
      <pin position="89" pad="PA28"/>
      <pin position="90" pad="GNDIO"/>
      <pin position="91" pad="VDDCORE"/>
      <pin position="92" pad="VDDIN"/>
      <pin position="93" pad="PA30"/>
      <pin position="94" pad="PA31"/>
      <pin position="95" pad="PB30"/>
      <pin position="96" pad="PB31"/>
      <pin position="97" pad="PB00"/>
      <pin position="98" pad="PB01"/>
      <pin position="99" pad="PB02"/>
      <pin position="100" pad="PB03"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>